DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-COUNTER PIC 9(5) VALUE 0.
01 I PIC 9(2) VALUE 1.
PROCEDURE DIVISION.
PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
    ADD 1 TO WS-COUNTER
END-PERFORM.
DISPLAY "Counter value: " WS-COUNTER.
STOP RUN.